app/Http/Controllers/CourseController.php

select * from `courses`
---
    public function index()
    {
        $courses = Course::with("category")->get();