app/Http/Controllers/GuestController.php

select * from `courses`
---
    public function index()
    {
        $courses = Course::all();